Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: དབྱངས་སམ། སྤྱོད་པ་འམ། རྒྱན་ཏམ་བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའ་འོ།
en: From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སའི་དོན་འདི་ཉིད་ཡང་བརྟག་པར་བྱ་བ་དང་། བསྟན་པར་བྱ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the bodhisattva Vajra­garbha, in order to teach the meaning of this bhūmi and to analyze it, recited these verses:

source: །དེ་དག་མཉེན་དྲང་ལས་རུང་འཇམ་པའི་སེམས་ལྡན་ཞིང་།
en: “They have serene, straightforward, capable minds.

source: །བསམ་པ་དགེ་དང་བསམ་པ་ཞི་དང་ལྡན་པ་རྣམས།
en: They are endowed with virtuous thoughts and tamed thoughts.

source: །འདུ་འཛིའི་དམྱིགས་བྲལ་རླབས་ཆེན་བློ་དང་ལྡན་པ་ཡི།
en: They are independent and have sublime understanding:

source: །ཆེ་ཉིད་སེམས་ལྡན་མཁས་པ་དེ་དག་གཉིས་ལ་འཕར།
en: These wise ones with exalted thought ascend to the second bhūmi.

source: །དེ་གནས་ཡོན་ཏན་འཆང་ཞིང་དགེ་བ་ཕུན་ལྡན་པ།
en: “Remaining on that bhūmi, they have qualities and virtues.

source: གཙེ་མེད་སེམས་ལྡན་སྲོག་གཅོད་རྣམ་པར་ཀུན་སྤངས་ཤིང་།
en: They are not motivated to harm, they have forsaken killing,

source: མ་བྱིན་ལེན་དང་གཞན་གྱི་ཆུང་མ་དེ་བཞིན་སྤངས།
en: They have forsaken taking what is not given and forsaken the wives of others,

source: །བདེན་དང་ལྡན་ཞིང་ཕྲ་མ་མི་སྨྲ་ཞེ་གཅོད་མེད།
en: They are truthful and do not slander or speak harshly.

source: །གཞན་གྱི་ལོངས་སྤྱོད་འདོད་སེམས་བྲལ་ཞིང་བྱམས་སེམས་ལྡན།
en: “They are free from coveting the possessions of others and have loving minds.

source: །དྲང་ཞིང་གཡོ་མེད་ཡང་དག་ལམ་དུ་རབ་ཏུ་ཞུགས།
en: They follow the correct path and do not deceive.

source: །གཡོ་མེད་ཐིབས་པོ་མེད་ཅིང་ཤིན་ཏུ་ངེས་པ་སྟེ།
en: They do not have deception or obscurity but are reliable.

source: རྟག་ཏུ་བག་ཡོད་སྟོན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྲུང་།
en: They maintain the conduct of a teacher and are always careful.

source: །སེམས་དམྱལ་བྱོལ་སོང་སྐྱེ་གནས་སྡུག་བསྔལ་ཇི་སྙེད་དང་། །གཤིན་རྗེའི་རིས་ན་ཡི་དགས་རྟག་ཏུ་ལུས་འབར་བ།
en: “All the sufferings in the hells and among animals, The continually burning bodies in Yama’s domain—

source: །དེ་དག་སྡིག་བློས་དགེ་བ་མྱིན་ལ་བརྩོན་པས་བྱུང་།
en: All arise from sin; they are created by bad actions.

source: །དེ་བས་དེ་སྤངས་བདེན་པའི་ཆོས་དང་ལྡན་པར་བྱ།
en: Therefore, abandon them and obtain the true Dharma.

source: །མྱི་ཡི་ནང་དུ་སྐྱེ་བ་ཡིད་དུ་འོང་ལ་སྩོགས།
en: “A desirable birth as a human being

source: །སྲིད་རྩེའི་བར་གྱི་ལྷ་ཡི་བསམ་གཏན་བདེ་བ་དང་། །རང་རྒྱལ་ཐེག་པ་དེ་བཞིན་ཉན་ཐོས་ཐེག་པ་དག །ཀུན་ཀྱང་དཀར་ལམ་བཅུ་པོས་བྱུང་བ་ཡིན་ཞེས་ཏེ།
en: Up to the bliss of the dhyāna deities at the summit of existence, And the Pratyeka­buddha­yāna and Śrāvaka­yāna— All are created by the ten paths of goodness.

source: །དེ་ལྟར་ཤེས་ཤིང་རྟག་པར་མཁས་པ་བག་ཡོད་པ།
en: “Knowing this, the wise are always careful.

source: །ཤིན་ཏུ་བསྡམས་པའི་ཡིད་ཀྱིས་ཕ་རོལ་ཚུལ་ལ་དགོད།
en: They maintain good conduct, and it becomes perfect.

source: །སེམས་ཅན་སྡུག་བསྔལ་ཤེས་ཤིང་སྙིང་བརྩེ་བསྐྱེད་བྱས་ནས། །དེ་བས་གོང་དུ་སྙིང་རྗེའི་སེམས་དང་ལྡན་པར་བྱེད།
en: More than before they have thoughts of compassion, And seeing the suffering of beings they develop kindness.

source: །ཀྱེ་མ་བྱིས་པའི་བློ་ཅན་འདི་དག་ལྟ་ངན་ལྷུང་།
en: “Alas! Those who have childlike minds fall into bad views,

source: །ཁྲོ་ཞིང་ཤར་གཉེར་གདོན་པ་ཀུན་སེམས་རྩོད་པ་ཅན།
en: They have minds of anger and enmity and engage in conflict,

source: །རྟག་ཏུ་མི་ངོམས་ཡུལ་ལ་ཡང་དང་ཡང་དུ་སྨོན།
en: And they are never satisfied and always yearn for objects of desire:

source: །གཞི་གསུམ་འབྲེལ་པ་དེ་དག་ཡོངས་སུ་དགྲོལ་བར་བྱ།
en: I shall liberate these beings who have three causes.

source: །གཏི་མུག་མུན་པ་ཆེན་པོས་ཀུན་ནས་ཡོག་པ་རྣམས།
en: “They are enveloped in the great darkness of ignorance,

source: །ལྟ་བའི་དྲ་མང་མྱ་ངམ་ལམ་དུ་ལྷུང་གྱུར་པ།
en: They have fallen into the trap of views on the path through the wilderness,

source: །འཁོར་བའི་ཤིང་ཐགས་ནང་ན་རྟག་ཏུ་དགྲས་གཙེ་ཞིང་།
en: And they are continually harmed by enemies in the cage of saṃsāra:

source: །བདུད་ཀྱི་ཆོམ་པོའི་ནང་གནས་དེ་དག་བདག་གིས་དགྲོལ།
en: I shall liberate them from the māra bandits.

source: །ཉོན་མོངས་རླབས་ཀྱིས་གཡེངས་ཤིང་ཆུ་བོ་བཞིར་ནུབ་པ།
en: “They drown in the four great rivers, tossed by the waves of the kleśas;

source: །ཁམས་གསུམ་སྡུག་བསྔལ་བརྒྱ་ཡིས་ཡོངས་སུ་གདུངས་པ་རྣམས།
en: They are tormented by the hundreds of sufferings in the three realms;

source: །ཕུང་པོའི་གནས་ལ་རྟེན་ཅིང་བདག་ཏུ་འདུ་ཤེས་པ།
en: And they live in the abode of the skandhas and perceive them as a self:

source: །དེ་དག་སྡུག་བསྔལ་དགྲོལ་དོན་བདག་གིས་བརྩོན་པར་བྱ།
en: I shall dedicate myself to liberating them from suffering.

source: །སངས་རྒྱས་ཡེ་ཤེས་དམ་པ་རྨད་བྱུང་ཕུལ་སྤངས་ཤིང་།
en: “They have rejected the wonderful sublime wisdom of the Buddha

source: །འབྱུང་བ་ཡོད་བཞིན་དམའ་བའི་བློ་གྲོས་སྐྱེད་བྱེད་པ།
en: And therefore have developed an inferior understanding.

source: །དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཡངས་དགོད་ཅེས།
en: I shall establish them in the Tathāgata’s stainless wisdom.

source: །རྒྱལ་བའི་ཡེ་ཤེས་དོན་དུ་བརྩོན་འགྲུས་ཡངས་པ་རྩོམ།
en: The wise have unrivaled diligence for the sake of the Jina’s wisdom.

source: །འདི་གནས་ཡོན་ཏན་བརྒྱ་བསྩགས་དྲང་སྲོང་ཆེན་པོ་རྣམས།
en: “On this bhūmi the great sages accumulate a hundred qualities.

source: །བདེ་གཤེགས་དུ་མ་མཐོང་ཞིང་མཆོད་པ་འང་རབ་ཏུ་བྱེད།
en: They see many sugatas and make offerings to them.

source: །དགེ་བ་དེ་དག་བསྐལ་པ་བྱེ་བར་ཕྱིར་ཞིང་སྦྱོང་།
en: They purify themselves through those good actions for ten million eons,

source: །གསེར་གྱི་དམ་པ་ནག་མཚུར་ནང་དུ་བཅུག་པ་བཞིན།
en: Like the best gold that is placed in green vitriol.

source: །འདི་གནས་རྒྱལ་སྲས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར།
en: “The jinaputras on this bhūmi become cakravartin kings

source: །དགེ་བ་བཅུ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་བྱེད།
en: Who lead beings to the ten good actions.

source: །དགེ་ཚོགས་གང་ཡང་རུང་སྟེ་སྩོགས་པར་བྱེད་པ་རྣམས།
en: They accumulate every kind of good action.

source: །སྟོབས་བཅུ་ལྡན་ཞིང་འགྲོ་བའི་སྐྱབས་འགྱུར་དོན་དུ་སོགས།
en: Through the ten strengths they become protectors of beings.

source: །འདོད་ན་རྒྱལ་པོའི་སྲིད་ཀྱང་རྣམ་པར་སྤངས་བྱས་ཤིང་།
en: “If they wish, they renounce the kingdom.

source: །བརྟན་པ་རྣམས་ནི་བསྟན་པའི་མཆོག་ལ་རབ་བྱུང་ནས།
en: Those stable ones take ordination in the supreme teaching.

source: །བརྩོན་འགྲུས་ལྡན་ཞིང་ཏིང་འཛིན་དམ་པ་མཆོག་ཀྱང་འཐོབ།
en: With diligence they attain supreme sublime samādhis,

source: །སངས་རྒྱས་སྟོང་ཚངས་སྐད་ཅིག་གཅིག་གིས་མཐོང་བར་བྱེད།
en: And in one instant they see a thousand buddhas.

source: །འདི་འདྲེའི་ཚུལ་གྱིས་བགྲང་བས་གཞན་ཡང་གཅིག་མིན་པ།
en: “In that way there will be that number or many more.

source: །ཁྱུ་མཆོག་ས་འདི་གནས་པ་རབ་ཏུ་སྟོན་པར་བྱེད།
en: The great leaders teach while remaining on this bhūmi.

source: །དེ་ཡི་གོད་ན་ཡེ་ཤེས་སྨོན་ལམ་མཆོག་ལྡན་པ།
en: They have the supreme prayer for wisdom that is higher,

source: །རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་དུ་མས་སེམས་ཅན་འདུལ།
en: And they guide beings through many forms of emanations.”

source: །དེ་ལྟར་ས་མཆོག་གཉིས་པ་འདི། །འཇིག་རྟེན་ཀུན་ལ་ཕན་འདོད་པའི། །བྱང་ཆུབ་སེམས་དཔའི་མཆོག་རྣམས་ལ།
en: In that way the bodhisattvas

source: །བདེ་བར་གཤེགས་པའི་སྲས་ཀྱིས་བསྟན།
en: Were taught the perfect second bhūmi.

source: །དྲི་མ་དང་བྲལ་བ་ཞེས་བྱ་བ་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པའོ།།
en: That was the second bodhisattva bhūmi, which is called Stainless.

source: །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་བཅོ་ལྔ་བ།
en: Having heard those words on the conduct of the perfect bhūmi,

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་བསམ་ཡས་པ། །ས་མཆོག་སྤྱོད་པ་དེ་སྐད་ཐོས་གྱུར་ནས།
en: The bodhisattva’s inconceivable field of activity,

source: །རྒྱལ་བའི་སྲས་རྣམས་རབ་ཏུ་དགའ་ཞིང་བསྟི་སྟང་དུ།
en: The jinaputras were overjoyed and respectful,

source: །མེ་ཏོག་སྤྲིན་ཆར་མངོན་པར་ཀུན་ནས་འབེབས།
en: And they scattered flowers upon the Jina. “Excellent!

source: །རི་ཡི་རྒྱལ་པོ་བོད་པ་ལེགས་སོ་ལེགས།
en: Excellent! You who are like a mountain,

source: །སེམས་ཅན་ཀུན་ལ་སྙིང་བརྩེ་བསམ་པ་ཡིས།
en: With a motivation of compassion for all beings

source: །ས་མཆོག་དམ་པའི་སྤྱོད་ཡུལ་དེ་འདྲ་དང་། །མཁས་པའི་ཚུལ་ཁྲིམས་སྡོམ་པ་ཁྱོད་ཀྱིས་བཤད།
en: You have taught the sublime perfect bhūmi’s field of activity And the correct conduct and vows of the wise ones.

source: །ཡང་དག་དེ་དངོས་མ་ནོར་གཞན་མིན་པའི།
en: “What you have taught is true, unmistaken and nothing else.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་འོང་ཞིང་།
en: It is the beautiful conduct of the bodhisattvas

source: །སེམས་ཅན་ཀུན་ལ་ཕན་དང་བདེ་བ་རབ་སེམས་པ།
en: Wishing to bring benefit and happiness to all beings.

source: །ཕུལ་དུ་འོད་གསལ་ཁྱོད་ཀྱིས་བསྟན་པ་བྱས།
en: You have taught this supreme illumination.

source: །ད་དུང་ད་ཆུད་ལྷ་དང་མིས་མཆོད་ཅིང་།
en: “Now still devas and humans are making offerings.

source: །ཆོས་ཀྱི་ཡེ་ཤེས་རིགས་པར་བརྗོད་མཁས་པ། །དེ་དག་སྤྱོད་ཡུལ་ཚུལ་ནི་ཇི་བཞིན་དུ།
en: You who are skilled in describing correctly the Dharma’s wisdom,

source: །ས་ཡི་དམ་པ་གསུམ་པོ་བརྗོད་པར་མཛོད།
en: Describe the third sublime bhūmi In accordance with the nature of their activity.

source: །དྲང་སྲོང་ཆེན་པོའི་སྦྱིན་ཚུལ་སྤྱོད་པ་དང་། །བཟོད་པ་བརྩོན་འགྲུས་ཞི་བ་ཤེས་རབ་ཐབས།
en: “The great sages’ practice of generosity, Their patience, diligence, peace, wisdom, methods,

source: །བྱམས་པའི་མཆོག་དང་སྙིང་རྗེའི་ལམ་གྱི་རྣམས།
en: Supreme love, and path of compassion—

source: །རྒྱལ་སྲས་སྤྱོད་པ་རྣམས་སྦྱང་བསྟན་མཛོད་ཅིག །རྡོ་རྗེའི་སྙིང་པོ་འཇིགས་མྱེད་ལ།
en: Teach us that training in the practice of the jinaputras.”

source: །རྣམ་གྲོལ་ཟླ་བས་ཡང་སྨྲས་པ།
en: Then Vimukti­candra said

source: །གསུམ་ལ་ཡང་དག་འཕར་འགྱུར་བའི།
en: To wise Vajra­garbha,

source: །བསམ་པ་མཁས་པས་བཤད་པར་མཛོད།
en: “Wise one, teach the motivation That causes ascent to the third bhūmi.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ།
en: The bodhisattva mahāsattva Vajra­garbha said, “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ས་གཉིས་པ་ལ་བསམ་པ་ཤིན་ཏུ་སྦྱངས་པ་ནི་ས་གསུམ་པ་ཡོངས་སུ་གནོན་ཏོ།
en: In that way through purifying his higher motivation on the second bodhisattva bhūmi he ascends to the third bhūmi.

source: དེ་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་བཅུས་ཡོངས་སུ་གནོན་ཏེ།
en: He ascends through ten kinds of focusing on his mind’s orientation.

source: དག་པའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། མི་གཡོ་བའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། སྐྱོ་བའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། ཕྱིར་མི་ལྡོག་པའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། བརྟན་པའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། སྦྱོངས་བའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། རློམ་པའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། རླབས་པོ་ཆེའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བ་དང་། བདག་ཉིད་ཆེ་བའི་སེམས་ཀྱི་བསམ་པ་ཡིད་ལ་བྱ་བའོ།
en: They are (1) focusing on the orientation of a pure mind, ( ) focusing on the orientation of a stable mind, (3) focusing on the orientation of a disenchanted mind, (4) focusing on the orientation of a mind without desire, (5) focusing on the orientation of an irreversible mind, (6) focusing on the orientation of a resolute mind, (7) focusing on the orientation of a refined mind, (8) focusing on the orientation of an insatiable mind, (9) focusing on the orientation of a sublime mind, and (10) focusing on the orientation of an exalted mind.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པ་ལ་གནས་པ་ནི་འདུ་བྱེད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལ་མི་རྟག་པ་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོག་གོ །སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། མི་སྡུག་པ་དང་། ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། རྣམ་པར་འཇིགས་པ་དང་། རིང་དུ་མི་གནས་པ་དང་། སྐད་ཅིག་ཏུ་འབྱུང་ཞིང་འགག་པ་དང་། མི་ཟད་ཅིང་མི་སྐྱེ་མི་འགག་པ་དང་། སྔོན་གྱི་མཐའ་ཀུན་ནས་མ་བྱུང་བ་དང་། ཕྱི་མའི་མཐའ་འཕོ་བ་མེད་པ་དང་། ད་ལྟར་བྱུང་བ་མི་གནས་པར་རབ་ཏུ་རྟོག་གོ །དེ་འདུ་བྱེད་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་ལ་རབ་ཏུ་རྟོག་པའི་ཚེ་མངོན་པར་འཇིག་པ་དང་། མྱ་ངན་ཅན་སྨྲེ་སྔགས་འདོན་པ་ཅན་དང་། འཁྲུག་པ་ཅན་ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བས་རྣམ་པར་བཅིངས་པ།
en: “O jinaputras, the bodhisattva who is on the third bodhisattva bhūmi realizes correctly, just as it is, that (1) all that is composite is impermanent. ( ) He sees the nature of that which is composite to be suffering, (3) unpleasantness, (4) unreliability, (5) destruction, (6) transitoriness, (7) momentary arising and ceasing, (8) nonarising in the past, (9) nontransference into the future, and (10) nonpresence in the present.

source: སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་མང་བ་བསྩགས་པ་མེད་པ་ལས་བྱུང་བ། འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་གི་མྱེ་རབ་ཏུ་འབར་བ། ནད་དུ་མས་རྣམ་པར་བསྐྱེད་པ། སྒྱུ་མའི་རང་བཞིན་ལྟ་བུར་མཐོང་ནས་དེ་དེ་བས་ཀྱང་འདུ་བྱེད་ཐམས་ཅད་ལས་སེམས་གྱེན་དུ་བསྐྱོད་ཅིང་།
en: “When he sees in that way the nature of composite phenomena, he sees that they are accompanied by (1) destruction, ( ) weeping, (3) misery, (4) wailing, (5) distress, (6) bondage by pleasure and displeasure, (7) great suffering, unhappiness, and distress, (8) being nonaccumulative, (9) the burning fires of desire, anger, and ignorance, (10) and numerous various illnesses. “He elevates his motivation, more than ever before, higher than composite phenomena, and he aims for the wisdom of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་རབ་ཏུ་གཏོང་སྟེ། དེས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་འང་རྗེས་སུ་མཐོང་སྟེ། མཚུངས་པ་མྱེད་པ་དང་། གཞལ་དུ་མེད་པ་དང་། རྙེད་པར་དཀའ་བ་དང་། མ་འདྲེས་པ་དང་། གནོད་པ་མེད་པ་དང་། འཁྲུག་པ་མེད་པ་དང་། མི་འཇིགས་པའི་གྲོང་རྡལ་དུ་འགྲོ་བ་དང་། ཕྱིར་མྱི་ལྡོག་པ་དང་། འགྲོ་བ་མང་པོ་ཡོངས་སུ་སྐྱོབ་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: “He sees the wisdom of the tathāgatas as (1) inconceivable, ( ) unequaled, (3) unfathomable, (4) hard to obtain, (5) unique, (6) invulnerable, (7) undisturbed, (8) having arrived at the city of no fear, (9) irreversible, (10) and protecting many beings.

source: །དེས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དེ་ལྟར་ཚད་མེད་པ་མཐོང་སྟེ། འདུ་བྱེད་ཀྱི་རྣམ་པ་དེ་ལྟར་སྡུག་བསྔལ་མང་པོས་གཙེས་པ་མཐོང་ནས།
en: “In that way, he sees the wisdom of the tathāgatas as beyond measure and sees that composite phenomena have numerous misfortunes.

source: སེམས་ཅན་ཐམས་ཅད་ལ་དེ་བས་ཀྱང་ཤས་ཆེར་སེམས་ཀྱི་བསམ་པ་བཅུ་ཉེ་བར་གཞོག་སྟེ།
en: More than ever before he develops ten perceptions of all beings.

source: མགོན་མེད་པ་དང་། སྐྱབས་མེད་པ་དང་། རྟེན་མེད་པའི་སེམས་ཀྱི་བསམ་པ་དང་། རྟག་ཏུ་འཕོངས་པའི་སེམས་ཀྱི་བསམ་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་མེ་ཀུན་ནས་འབར་བའི་སེམས་ཀྱི་བསམ་པ་དང་། སྲིད་པའི་བཙོན་རས་བཟུང་བའི་སེམས་ཀྱི་བསམ་པ་དང་། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཉོན་མོངས་པའི་ཐིབས་པོས་བསྒྲིབས་པའི་སེམས་ཀྱི་བསམ་པ་དང་། བརྟག་པའི་མཐུ་མེད་པའི་སེམས་ཀྱི་བསམ་པ་དང་། དགེ་བའི་ཆོས་ལ་མོས་པ་མེད་པའི་སེམས་ཀྱི་བསམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལས་ཤིན་ཏུ་གོལ་བའི་སེམས་ཀྱི་བསམ་པ་དང་། འཁོར་བའི་རྒྱུད་ཀྱི་རྗེས་སུ་འབབ་པའི་སེམས་ཀྱི་བསམ་པ་དང་། ཐར་པའི་ལམ་གྱིས་སྡངས་པའི་སེམས་ཀྱི་བསམ་པ་དང་། །སེམས་ཀྱི་བསམ་པ་འདི་བཅུ་ཉེ་བར་གཞོག་གོ །དེ་ནས་དེ་ལྟར་སེམས་ཅན་གྱི་ཁམས་གཙེ་བ་མང་པོ་ཅན་མཐོང་ནས།
en: (3) as burning with the fires of desire, anger, and ignorance; (4) as being imprisoned in the dungeon of existence; (5) as being continuously enveloped in the darkness of the kleśas; (6) as having the thoughts of a mind that does not have the power to examine; (7) as having no aspiration to good qualities; (8) as having gone astray from the entire Dharma of the Buddha; (9) as being swept along in the current of saṃsāra; and (10) as being terrified by the path to liberation.

source: བརྩོན་འགྲུས་འདི་ལྟར་རྩོམ་སྟེ།
en: Those are the ten perceptions he acquires. “Then, seeing that the realm of beings has many misfortunes, he engages in this kind of diligence:

source: སེམས་ཅན་འདི་དག་ནི་བདག་གིས་བསྐྱབ་པར་བྱ་བ་ཡོངས་སུ་དགྲོལ་བར་བྱ་བ། ཡོངས་སུ་སྦྱང་བར་བྱ་བ། ཤིན་ཏུ་གདོན་པར་བྱ་བ་རབ་ཏུ་དགོད་པར་བྱ་བ། ཤིན་ཏུ་བརྟན་པར་བྱ་བ། ཡོངས་སུ་ཚིམ་པར་བྱ་བ། གནས་སུ་ཕྱིན་པར་བྱ་བ། རྣམ་པར་གདུལ་བར་བྱ་བ་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱ་བ་ཡིན་ནོ།
en: (1) ‘I will protect these beings, ( ) I will liberate them, (3) I will purify them, (4) I will raise them up, (5) I will establish them, (6) I will make them stable, (7) I will satisfy them, (8) I will nurture them, (9) I will tame them, and (10) I will cause them to enter nirvāṇa.’

source: །ཞེས་ནས་དེ་དེ་ལྟར་འདུ་བྱེད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལས་སྐྱོ་བའི་རྗེས་སུ་སོང་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལ་རབ་ཏུ་ལྟ་བའི་རྗེས་སུ་སོང་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་སོང་ཞིང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་རབ་ཏུ་རྟེན་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པར་བྱ་བ་ལ་བརྩོན་པ་དེ་འདི་ལྟར་ཡོངས་སུ་རྟོག་སྟེ།
en: “He is thus disenchanted with the nature of composite phenomena, considers all beings, puts his trust in the wisdom of the tathāgatas as omniscient wisdom, and is dedicated to protecting beings.

source: རྒྱུ་དང་གཞི་དང་ཚུལ་དང་ཐབས་གང་ཞིག་གིས་འདི་ལྟ་བུར་སྡུག་བསྔལ་དང་། ཉེ་བའི་ཉོན་མོངས་པར་ལྟུང་བའི་སེམས་ཅན་འདི་དག་མངོན་པར་གདོན་པར་ནུས་རྒྱུ་དང་གཞི་དང་ཚུལ་དང་ཐབས་གང་ཞིག་གིས་ནི་ཤིན་ཏུ་བདེ་བའི་མྱ་ངན་ལས་འདས་པར་དགོད་པར་ནུས་སྙམ་ནས། །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He considers in this way: ‘Through what method or path can I raise up these beings who have fallen into suffering and the kleśas, and bring them to the ultimate happiness of nirvāṇa?’

source: བསྒྲིབས་པ་མེད་པའི་ཡེ་ཤེས་རྣམ་པར་ཐར་པའི་གནས་མ་གཏོགས་པར་གཞན་གྱིས་མི་ནུས་སོ།
en: “The bodhisattva concludes, ‘That can only come from unobscured wisdom, the state of liberation.

source: །བསྒྲིབས་པ་མེད་པའི་ཡེ་ཤེས་རྣམ་པར་ཐར་པའི་གནས་དེ་ཡང་ཆོས་ཐམས་ཅད་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པ་མ་གཏོགས་པར་གཞན་གྱིས་ཐོབ་པར་མི་ནུས་སོ།
en: Unobscured wisdom, the state of liberation, can only come from the realization of the exact nature of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པ་ཡང་རྒྱུ་བ་མེད་ཅིང་སྐྱེ་བ་མེད་པ་ལ་སྤྱོད་པའི་ཤེས་རབ་མ་གཏོགས་པར་གཞན་གྱིས་ཁོང་དུ་ཆུད་པར་མི་ནུས་སོ།
en: The realization of the exact nature of all phenomena can only come from the wisdom of nonoccurrence, nonarising.

source: །ཤེས་རབ་ཀྱི་སྣང་བ་དེ་ཡང་བསམ་གཏན་ལ་མཁས་ཤིང་རྟོགས་པའི་བློས་རབ་ཏུ་རྟོག་པ་མེད་པར་གཞན་གྱིས་ཐོབ་པར་མི་རུང་ངོ་།
en: The light of that wisdom can only come from skill in dhyāna and certainty of realization.

source: །བསམ་གཏན་ལ་མཁས་ཤིང་རྟོགས་པའི་བློས་རབ་ཏུ་རྟོག་པ་དེ་ཡང་ཐོས་པས་མཁས་པ་མྱེད་པར་མི་འབྱུང་ངོ་།
en: Skill in dhyāna and certainty of realization can only come from becoming learned through listening.’

source: །ཞེས་དེ་དེ་ལྟར་ཤིན་ཏུ་བརྟགས་པའི་ཤེས་པ་དང་ལྡན་པས་དེ་བས་ཀྱང་ཤས་ཆེར་དམ་པའི་ཆོས་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པར་གནས་ཏེ་ཉིན་མཚན་དུ་ཆོས་མཉན་པ་དོན་དུ་གཉེར་བ་ཡིན།
en: “He has that kind of knowledge through examination, and more than ever he is engaged in diligently seeking for the sublime Dharma.

source: སངས་རྒྱས་ཀྱི་ཆོས་བཙལ་བའི་དོན་དུ་ཆོས་ལ་མོས་ཤིང་ངོམས་མི་ཤེས་ལ་རྒྱུན་མི་འཆད་པ་ཡིན། ཆོས་ལ་དགའ་ཞིང་སྤྲོ་བ་དང་། ཆོས་ལ་རབ་ཏུ་འཇུག་པ་ཡིན། ཆོས་ལ་གཞོལ་ཞིང་ཆོས་ལ་འབབ་པ་དང་། ཆོས་ལ་འབབ་པ་ཡིན། ཆོས་ལ་རྟེན་ཅིང་ཆོས་ལ་སྐྱབས་ཚོལ་བ་དང་། ཆོས་ལ་མཐུ་ཚོལ་བ་ཡིན། ཆོས་དང་གཉེར་བའི་ཆོས་ལ་མངོན་པར་བརྩོན་པ་ཡིན་ཏེ།
en: He is dedicated to listening to the Dharma day and night, he fulfills his insatiable desire for the Dharma, he is constantly seeking the Buddha’s Dharma, he delights in the Dharma, he enjoys the Dharma, he depends on the Dharma, he is focused on the Dharma, he is intent upon the Dharma, he is predisposed to the Dharma, he is devoted to the Dharma, he clings to the Dharma, he protects the Dharma, and he has the correct practice of the Dharma.

source: དེ་དེ་ལྟར་ཆོས་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པས་རིན་པོ་ཆེའི་རྣམ་པ་འམ། དབྱིག་གི་རྣམ་པ་འམ། ནོར་དང་། འབྲུའི་མཛོད་དང་བང་བ་གང་ཡང་རུང་སྟེ། ཡོངས་སུ་མི་གཏོང་བ་དེ་ལྟ་བུ་གང་ཡང་མྱེད་དོ།
en: “He is so dedicated to seeking the Dharma that there is nothing precious, no wealth, no riches, no grain store, and no treasury that he will not give away.

source: །ཆོས་སྨྲ་བའི་གང་ཟག་དེ་འབའ་ཞིག་ལ་དཀའ་བའི་འདུ་ཤེས་སུ་གྱུར་པ་ལས་ཕར་དེ་དག་གཞན་ལ་ཅུང་ཟད་ཀྱང་དཀའ་བའི་འདུ་ཤེས་མྱི་བསྐྱེད་དོ།
en: Because of his delight in the Dharma, he does not perceive it as a hardship. Otherwise, when a dharmabhāṇaka recites even one word he will perceive it as a hardship.

source: །དེ་ནི་ཆོས་ཀྱི་དོན་དུ་ཕྱི་རོལ་གྱི་དངོས་པོ་ཉེ་བར་བཟུང་བ་ཡོངས་སུ་མི་གཏོང་བ་དེ་གང་ཡང་མྱེད་དོ། །ནང་གི་དངོས་པོ་ཡོངས་སུ་མི་གཏོང་བར་བྱ་བ་དེ་ལྟ་བུ་འང་ཅུང་ཟད་ཀྱང་མྱེད་དོ།
en: “There is nothing that he has externally acquired that he will not give away for the sake of the Dharma, and there is nothing of himself that he will not give away.

source: །གང་འདི་དག་འདི་ལྟ་སྟེ། གཡོག་འཁོར་ཡོངས་སུ་གཏང་བའམ། རྒྱལ་སྲིད་ཡོངས་སུ་གཏང་བའམ། ལོངས་སྤྱོད་ཡོངས་སུ་གཏང་བ་འམ།
en: What are these?

source: ནོར་དང་འབྲུ་དང་། ནོར་བུ་དང་། གསེར་གྱི་མཛོད་དང་། བང་བ་ཡོངས་སུ་གཏང་བ་དང་། རྟ་དང་གླང་པོ་དང་། ཤིང་རྟ་དང་། བཞོན་པ་ཡོངས་སུ་གཏང་བ་འམ་རིན་པོ་ཆེའི་རྒྱན་དང་ལྷབ་ལྷུབ་ཡོངས་སུ་གཏང་བ་དང་། ཆུང་མ་དང་བུ་དང་བུ་མོ་ཡོངས་སུ་གཏང་བ་འམ།
en: He will give away his servants, he will give away his kingdom, he will give away his possessions, and he will give away his wealth and grain and his jewels, gold, and treasury. He will give away his horses, elephants, chariots, and steeds. He will give away his precious jewelry and ornaments. He will give away his wives, his sons, and his daughters.

source: མགོ་དང་རྐ་ལག་དང་ཡན་ལག་གི་དམ་པ་ཡོངས་སུ་གཏང་བ་འམ།
en: He will give away his head, feet, hands, and limbs.

source: ལུས་ཐམས་ཅད་ཡོངས་སུ་གཏད་བར་བྱ་བ་ཡང་རུང་སྟེ།
en: He will give away his entire body.

source: དེ་དག་ཐམས་ཅད་ཆོས་ཀྱི་དོན་དུ་ཡོངས་སུ་མི་གཏོང་བ་གང་ཡང་མྱེད་དོ།
en: There is none of this that he will not give away for the sake of the Dharma.

source: །བླ་མ་ལ་བསྙེན་བཀུར་དང་རིམ་གྲོ་བྱ་བ་གང་ཡང་རུང་སྟེ།
en: “There is nothing that he will not do in order to serve and attend the guru.

source: ཉམས་སུ་མི་ལེན་པ་གང་ཡང་མེད་དོ། །ང་རྒྱལ་དང་ལྷག་པའི་ང་རྒྱལ་ཡོངས་སུ་གཏང་བས། ང་རྒྱལ་མེད་པ་ལ་སྤྱད་པ་གང་ཡང་རུང་སྟེ།
en: There is nothing that he will not do, eliminating pride and arrogance and serving humbly.

source: ཉམས་སུ་མི་ལེན་པ་གང་ཡང་མྱེད་དོ། །ལུས་ཀྱི་གནོད་པ་གང་ཡང་རུང་སྟེ།
en: There is nothing that would be physically painful that he will not do.

source: ཉམས་སུ་མི་ལེན་པ་གང་ཡང་མྱེད་དོ། །དེ་མ་ཐོས་པའི་ཆོས་ཀྱི་ཚིག་གཅིག་ཐོས་པ་ནོར་ཆེ་བར་འཛིན་གྱིས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་གང་བའི་རིན་པོ་ཆེའི་ཕུང་པོ་ཐོབ་པས་མ་ཡིན་ནོ།
en: He is made happy by hearing one word of Dharma that he has not heard before, and not by great wealth, not by obtaining a mass of jewels that would fill the great universe of a thousand million worlds.

source: །ལེགས་པར་བཤད་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཐོས་པས་སེམས་དགའ་བར་འགྱུར་གྱི། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་བོའི་སྲིད་ལ་བསྐལ་པ་བརྒྱ་སྟོང་མང་པོའི་མཐར་ཐུག་པར་གནས་པས་ནི་མ་ཡིན་ནོ། །དེ་ལ་ལ་ལ་ཞིག་བརྒྱ་ལ་འདི་སྐད་དུ་ཟེར་ཏེ།
en: He is made happy by hearing one verse of the excellent teaching and not by becoming Śakra, Brahmā, or a cakravartin king for many hundreds of thousands of eons.

source: གལ་ཏེ་ཁྱོད་ཀྱིས་མེའི་དོང་ཆེན་པོར་ལུས་བོར་ཏེ། སྡུག་བསྔལ་གྱི་ཚོར་བའི་ཕུང་པོ་ཆེན་པོ་རང་གི་ལུས་ཀྱིས་ཉམས་སུ་བླང་བར་ནུས་ན། ངས་ཁྱོད་ལ་ཆོས་ཀྱི་ཚིག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བསྟན་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྤྱོད་པ་འདི་བཤད་པར་བྱའོ། །ཞེ་ན་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ་ཆོས་ཀྱི་ཚིག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བསྟན་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྦྱོང་བའི་དོན་དུ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མེས་གང་བར་ཡང་ཚངས་པའི་འཇིག་རྟེན་ནས་བདག་གིས་བདག་དོར་བར་མོས་ན་མེའི་དོང་ཐ་མལ་པ་ནི་འདི་ལྟ་ཞིག་ཏུ་བདག་དོར་བ་ལྟ་ཅི་སྨོས་ཀྱིས།
en: “If someone were to declare to him, ‘If you can throw your body into this great pit of fire and experience that vast sensation of physical suffering, I will teach to you one word of the perfect Buddha’s Dharma, which teaches the refinement of the bodhisattva’s conduct,’ then he would think, ‘In order to receive one word of the perfect Buddha’s Dharma teaching on purifying the bodhisattva conduct, I would leap from the Brahmā realm into a fire that fills the great universe of a thousand million worlds, not to mention throw myself into an ordinary pit of fire like this.
